uhnp/src/Reports/ПлатежныйКалендарьУХ/ПлатежныйКалендарьУХ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ПлатежныйКалендарьУХ</name>
  <comment>(-УХ)</comment>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОтбора</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>СохраненнаяВерсияПлатежногоКалендаря</name>
    <type>
      <types>CatalogRef.СохраненныеВерсииПлатежногоКалендаря</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаОтображения</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьОстаткиСУчетомОвердрафтов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьПоступленияПередСписаниями</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СворачиватьНеуправляемыеСписания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СортироватьУправляемыеСписанияПоПриоритету</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СортироватьУправляемыеСписанияПоПриоритетуПоУбыванию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СортироватьУправляемыеСписанияПоСумме</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СортироватьУправляемыеСписанияПоСуммеПоУбыванию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧислоДнейОперативногоПланирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаОтображенияПросроченныхПлатежей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СценарийСтрессТестированияЛиквидности</name>
    <type>
      <types>CatalogRef.СценарииСтрессТестированияЛиквидности</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьДиаграмму</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьОбороты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоризонтОперативногоПланирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресХранилищаТаблицыОстатковИОборотов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресМакетаОформления</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныйКалендарь</name>
    <type>
      <types>CatalogRef.ПроизводственныеКалендари</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоОтбораПросроченныхЗаявок</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПереводаМеждуСчетами</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентКомиссииПриКонвертацииВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СущественнаяРазницаСтоимостиКредитов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьДанныеВВалютеОтображения</name>
    <comment>Выводить данные календаря в валюте отображения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппировкиОтчета</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоризонтТактическогоПланирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьОперативногоПланирования</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьТолькоКассовыеРазрывы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантПлатежногоКалендаря</name>
    <type>
      <types>EnumRef.ВариантыПлатежногоКалендаря</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникВходящихОстатков</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникСобытияФормированияОтчета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимВыводаОборотов</name>
    <type>
      <types>EnumRef.РежимыВыводаОборотовПлатежногоКалендаря</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаАнализаЭкстраполяцииДенежныхПотоков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПериодовДолгосрочногоПланирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГоризонтДолгосрочногоПланирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьДополнительныеСведения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеСведения</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресХранилищаДанныхДоговоров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксироватьДополнительныеСведения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДоверительныеКоэффициентыПриПланированииПоступлений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоБазоваяФункциональность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПлановыеКурсы</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Курс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Кратность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МатрицаВесовЛиквидности</name>
    <attributes>
      <name>Источник</name>
      <type>
        <types>EnumRef.ИсточникиДанныхПлатежногоКалендаря</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриходРасход</name>
      <type>
        <types>EnumRef.ВидыДвиженийПриходРасход</types>
      </type>
    </attributes>
    <attributes>
      <name>ГоризонтПланированияЛиквидности</name>
      <type>
        <types>EnumRef.ГоризонтыПланированияЛиквидности</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>DefinedType.ВесИсточникаДанныхПлатежногоКалендаря</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкаВариантовОптимизации</name>
    <attributes>
      <name>ВариантОптимизации</name>
      <type>
        <types>EnumRef.ВариантыОптимизацииПлатежногоКалендаря</types>
      </type>
    </attributes>
    <attributes>
      <name>Используется</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Report>

uhnp/src/InformationRegisters/ВерсииГрафиковРасчетов/ВерсииГрафиковРасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВерсииГрафиковРасчетов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ОпорныйГрафик</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>План</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВерсияГрафика</name>
    <type>
      <types>DefinedType.ВерсияГрафика</types>
    </type>
  </resources>
  <dimensions>
    <name>ПредметГрафика</name>
    <type>
      <types>DefinedType.ПредметГрафика</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/AccumulationRegisters/РасчетыСКонтрагентамиФакт/РасчетыСКонтрагентамиФакт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыСКонтрагентамиФакт</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>СтатьяБюджета</name>
    <type>
      <types>Characteristic.ВидыБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриходРасход</name>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидБюджета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговораУХ</name>
    <type>
      <types>CatalogRef.ВидыДоговоровКонтрагентовУХ</types>
    </type>
  </attributes>
  <attributes>
    <name>НачальныеОстатки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>DefinedType.Договор</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРасчетов</name>
    <type>
      <types>DefinedType.ОбъектРасчетовУХ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭлементСтруктурыЗадолженности</name>
    <type>
      <types>EnumRef.ЭлементыСтруктурыЗадолженности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

uhnp/src/AccumulationRegisters/РасчетыСКонтрагентамиГрафики/РасчетыСКонтрагентамиГрафики.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыСКонтрагентамиГрафики</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>СтатьяБюджета</name>
    <type>
      <types>DefinedType.СтатьиБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриходРасход</name>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаПлатежа</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КурсПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика4</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика5</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика6</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидБюджета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Операция</name>
    <comment>Операция графика</comment>
    <type>
      <types>CatalogRef.ОперацииГрафиковДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетОрганизации</name>
    <type>
      <types>DefinedType.БанковскийСчетОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетКонтрагента</name>
    <type>
      <types>DefinedType.БанковскийСчетКонтрагента</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРегистратор</name>
    <type>
      <types>DefinedType.РегистрацияДанныхБюджетированияСсылки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговораУХ</name>
    <type>
      <types>CatalogRef.ВидыДоговоровКонтрагентовУХ</types>
    </type>
  </attributes>
  <attributes>
    <name>БезакцептноеСписание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВерсияГрафика</name>
    <type>
      <types>DefinedType.ВерсияГрафика</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПредметГрафика</name>
    <type>
      <types>DefinedType.ПредметГрафика</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭлементСтруктурыЗадолженности</name>
    <type>
      <types>EnumRef.ЭлементыСтруктурыЗадолженности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

uhnp/src/Reports/ПлатежныйКалендарьУХ/Forms/ФормаПодбораФинансовыхИнструментов/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("РедактированиеТекущейОперации") Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры.УточнениеОперации);
		ЗапланированныеСделки.Загрузить(ПолучитьИзВременногоХранилища(Параметры.АдресТаблицыЗапланированныхСделок));
		НачальныйОстатокНаСчете = Параметры.ОстатокНаСчете;
		ПересчитатьКонечныйОстаток(ЭтотОбъект);
	Иначе		
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры.ДанныеЗаполнения);
		ЗапланированныеСделки.Загрузить(ПолучитьИзВременногоХранилища(Параметры.ДанныеЗаполнения.АдресТаблицыЗапланированныхСделок));
		ПериодИспользования.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
		ПериодИспользования.ДатаНачала = Параметры.ДанныеЗаполнения.ДатаНачала;
		Сумма = ?(КонечныйОстаток < 0, -КонечныйОстаток, КонечныйОстаток);
		НачальныйОстатокНаСчете = КонечныйОстаток;	
	КонецЕсли;
	
	Заголовок = ?(ЭтоПривлечениеСредств, НСтр("ru = 'Привлечение средств'"), НСтр("ru = 'Размещение средств'"));
		
	Элементы.Сумма.Заголовок = ?(ЭтоПривлечениеСредств, НСтр("ru = 'Сумма привлечения'"), НСтр("ru = 'Сумма размещения'"));
	
	УстановитьУсловноеОформление();
	
	ОбновитьДанныеСрокаИспользования(ЭтаФорма);
	ЗаполнитьДоступныеИнструменты();
	
	// установить отметку на договор
	Если ЗначениеЗаполнено(ФинансовыйИнструмент) Тогда
		ПомеченныеСтроки = ДоступныеИнструменты.НайтиСтроки(Новый Структура("ДоговорКонтрагента",ФинансовыйИнструмент));
		Для Каждого ТекСтрока Из ПомеченныеСтроки Цикл
			ТекСтрока.Пометка = Истина;
		КонецЦикла;
	КонецЕсли;
	
	ЭтоПодборДоговора = Истина;
	Элементы.ГруппаНовыйДоговор.Видимость = Ложь;
	
	УстановитьДоступностьВалют();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	МассивНепроверяемыхРеквизитов.Добавить("Сумма");
	Если НЕ ЗначениеЗаполнено(Сумма) Тогда
		
		ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,,"Сумма");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ,"Сумма",,Отказ);
		
	КонецЕсли;
	
	МассивНепроверяемыхРеквизитов.Добавить("ПериодИспользования");
	Если Не ЗначениеЗаполнено(ПериодИспользования.ДатаНачала) ИЛИ НЕ ЗначениеЗаполнено(ПериодИспользования.ДатаОкончания) Тогда
		ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,"Корректность", НСтр("ru = 'Период использования'"),,,НСтр("ru = 'Необходимо задать дату начала и дату окончания.'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,"ПериодИспользования",,Отказ);
	КонецЕсли;
	
	МассивНепроверяемыхРеквизитов.Добавить("ФинансовыйИнструмент");
	
	Если Не ЗначениеЗаполнено(ФинансовыйИнструмент) И ЭтоПодборДоговора Тогда
		ТекстОшибки = НСтр("ru = 'Необходимо выбрать инструмент из списка доступных.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,"ГруппаТабличныйДокумент",,Отказ);
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодИспользованияПриИзменении(Элемент)
	ОбновитьДанныеСрокаИспользования(ЭтаФорма);
	ЗаполнитьДоступныеИнструменты();
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	ПересчитатьКонечныйОстаток(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура СуммаЗачисленияПриИзменении(Элемент)

	Сумма = СуммаЗачисления*Курс;
    ПересчитатьКонечныйОстаток(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура РежимПриИзменении(Элемент)
	
	Элементы.ГруппаТабличныйДокумент.Видимость = ЭтоПодборДоговора;
	Элементы.ГруппаНовыйДоговор.Видимость = Не ЭтоПодборДоговора;
	Если Не ЭтоПодборДоговора Тогда 
		 ВалютаЗачисления = Неопределено;
		 СуммаЗачисления = 0;
		ПомеченныеСтроки = ДоступныеИнструменты.НайтиСтроки(Новый Структура("ДоговорКонтрагента",ФинансовыйИнструмент));
		Для Каждого ТекСтрока Из ПомеченныеСтроки Цикл
			ТекСтрока.Пометка = Ложь;
		КонецЦикла;
		ФинансовыйИнструмент = Неопределено;
	КонецЕсли;
	УстановитьДоступностьВалют();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ДоступныеИнструменты
&НаКлиенте
Процедура ДоступныеИнструментыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = Элемент.ТекущиеДанные;
	
	ПомеченныеСтроки = ДоступныеИнструменты.НайтиСтроки(Новый Структура("ДоговорКонтрагента",ФинансовыйИнструмент));
	Для Каждого ТекСтрока Из ПомеченныеСтроки Цикл
		ТекСтрока.Пометка = Ложь;
	КонецЦикла;
	
	ФинансовыйИнструмент = ТекДанные.ДоговорКонтрагента;
	ПроцентнаяСтавка = ТекДанные.ПроцентнаяСтавка;
	ТекДанные.Пометка = Истина; 
	// Управление валютами 
	ВалютаЗачисления = ТекДанные.Валюта;
	Курс = ТекДанные.Курс;
	Если ЗначениеЗаполнено(ВалютаЗачисления)
		 И ВалютаЗачисления <> Валюта И ЗначениеЗаполнено(Курс) Тогда
		СуммаЗачисления = Сумма/Курс;
		Сумма = СуммаЗачисления*Курс;
	Иначе
		СуммаЗачисления = 0;	
	КонецЕсли; 
	
	УстановитьДоступностьВалют();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Закрыть(СтруктураВозвращаемыхЗначений());
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДоговор(Команда)
	
	ТекДанные = Элементы.ДоступныеИнструменты.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ПоказатьЗначение(,ТекДанные.ДоговорКонтрагента);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДоступныеИнструменты()
	
	Запрос = Новый Запрос;
	Запрос.Текст = ?(ЭтоПривлечениеСредств, ТекстЗапросаПривлечение() , ТекстЗапросаРазмещение() );
	
	Запрос.УстановитьПараметр("ДатаПривлечения", ПериодИспользования.ДатаНачала);
	Запрос.УстановитьПараметр("Валюта", Валюта);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ЗапланированныеСделки", ЗапланированныеСделки.Выгрузить());
	
	ДоступныеИнструменты.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьДанныеСрокаИспользования(Форма)
	
	Если ЗначениеЗаполнено(Форма.ПериодИспользования.ДатаНачала) И ЗначениеЗаполнено(Форма.ПериодИспользования.ДатаОкончания) Тогда
		
		Форма.Элементы.ПериодИспользования.ОтметкаНезаполненного = Ложь;
		Форма.КоличествоДней = Окр((НачалоДня(Форма.ПериодИспользования.ДатаОкончания) 
										- НачалоДня(Форма.ПериодИспользования.ДатаНачала)) / 86400);			
		Форма.НадписьКоличествоДней = 
			СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(НСтр("ru=';%1 день;;%1 дня;%1 дней;'"), Форма.КоличествоДней)	
	Иначе
		
		Форма.Элементы.ПериодИспользования.ОтметкаНезаполненного = Истина;
		Форма.КоличествоДней = 0;
		Форма.НадписьКоличествоДней = "";
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция СтруктураВозвращаемыхЗначений()
	
	Результат = Новый Структура("Сумма,Валюта,ВалютаОплаты, СуммаОплаты, ПериодИспользования,КоличествоДней,БанковскийСчетКасса,
	|Организация,ФинансовыйИнструмент,ЭтоПривлечениеСредств,ПроцентнаяСтавка,ВидОперации,Контрагент,НаименованиеДоговора,ВидДенежныхСредств");
	ЗаполнитьЗначенияСвойств(Результат, ЭтаФорма);
	Если ЭтоПодборДоговора И ЭтоПривлечениеСредств Тогда
		ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежногоКалендаря.ПривлечениеФинансирования");  
		Если ЗначениеЗаполнено(ВалютаЗачисления)
				И ЗначениеЗаполнено(СуммаЗачисления) Тогда
			Результат.Сумма = СуммаЗачисления;
			Результат.Валюта = ВалютаЗачисления;
			Результат.ВалютаОплаты = Валюта;
			Результат.СуммаОплаты = Сумма;
		КонецЕсли;
	ИначеЕсли ЭтоПодборДоговора И Не ЭтоПривлечениеСредств Тогда	
		ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежногоКалендаря.РазмещениеСредств");
	ИначеЕсли Не ЭтоПодборДоговора И ЭтоПривлечениеСредств Тогда
		ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежногоКалендаря.НовыйДоговорКредита");
	ИначеЕсли Не ЭтоПодборДоговора И Не ЭтоПривлечениеСредств Тогда	
		ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежногоКалендаря.НовыйДоговорДепозита");
	КонецЕсли;
	Результат.ВидОперации = ВидОперации;
		
	Возврат Результат;
КонецФункции

&НаСервере
Функция ТекстЗапросаПривлечение()

	ТекстЗапроса =  
	"ВЫБРАТЬ
	|	ВТ_ЗапланированныеСделки.ФинансовыйИнструмент КАК ДоговорКонтрагента,
	|	ВТ_ЗапланированныеСделки.Сумма КАК Сумма,
	|	ВТ_ЗапланированныеСделки.ДатаНачала КАК ДатаНачала,
	|	ВТ_ЗапланированныеСделки.ДатаОкончания КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТ_ЗапланированныеСделки
	|ИЗ
	|	&ЗапланированныеСделки КАК ВТ_ЗапланированныеСделки
	|ГДЕ
	|	ВТ_ЗапланированныеСделки.ДатаНачала <= &ДатаПривлечения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КредитныеЛинии.Ссылка КАК ДоговорКонтрагента,
	|	КредитныеЛинии.Контрагент КАК Контрагент,
	|	КредитныеЛинии.ПроцентнаяСтавка КАК ПроцентнаяСтавка,
	|	КредитныеЛинии.МинимальныйСрок КАК МинимальныйСрок,
	|	КредитныеЛинии.МаксимальныйСрок КАК МаксимальныйСрок,
	|	КредитныеЛинии.МинимальнаяСуммаСделки КАК МинимальнаяСуммаСделки,
	|	КредитныеЛинии.МаксимальнаяСуммаСделки КАК МаксимальнаяСуммаСделки,
	|	КредитныеЛинии.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	КредитныеЛинии.ОсновнаяВалютаПлатежей КАК ОсновнаяВалютаПлатежей,
	|	КредитныеЛинии.Сумма - ВЫБОР
	|		КОГДА КредитныеЛинии.ВозобновляемыйЛимит
	|			ТОГДА СУММА(ЕСТЬNULL(РасчетыПоФинансовымИнструментамГрафикиОстаткиИОбороты.СуммаКонечныйОстаток, 0))
	|		ИНАЧЕ СУММА(ЕСТЬNULL(РасчетыПоФинансовымИнструментамГрафикиОстаткиИОбороты.СуммаПриход, 0))
	|	КОНЕЦ КАК Доступно,
	|	КредитныеЛинии.ВозобновляемыйЛимит КАК ВозобновляемыйЛимит
	|ПОМЕСТИТЬ ВТ_АктивныеДоговоры
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДоговорыКредитовИДепозитов.Контрагент КАК Контрагент,
	|		ДоговорыКредитовИДепозитов.Ссылка КАК Ссылка,
	|		ДоговорыКредитовИДепозитов.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|		ДоговорыКредитовИДепозитов.ОсновнаяВалютаПлатежей КАК ОсновнаяВалютаПлатежей,
	|		ВЫРАЗИТЬ(ВерсииРасчетовСрезПоследних.Регистратор КАК Документ.ВерсияСоглашенияКредит) КАК ВерсияПараметров,
	|		ВЫРАЗИТЬ(ВерсииРасчетовСрезПоследних.Регистратор КАК Документ.ВерсияСоглашенияКредит).МинимальныйСрок КАК МинимальныйСрок,
	|		ВЫРАЗИТЬ(ВерсииРасчетовСрезПоследних.Регистратор КАК Документ.ВерсияСоглашенияКредит).МаксимальныйСрок КАК МаксимальныйСрок,
	|		ВЫРАЗИТЬ(ВерсииРасчетовСрезПоследних.Регистратор КАК Документ.ВерсияСоглашенияКредит).МинимальнаяСуммаСделки КАК МинимальнаяСуммаСделки,
	|		ВЫРАЗИТЬ(ВерсииРасчетовСрезПоследних.Регистратор КАК Документ.ВерсияСоглашенияКредит).МаксимальнаяСуммаСделки КАК МаксимальнаяСуммаСделки,
	|		ВЫРАЗИТЬ(ВерсииРасчетовСрезПоследних.Регистратор КАК Документ.ВерсияСоглашенияКредит).ПроцентнаяСтавка КАК ПроцентнаяСтавка,
	|		ВЫРАЗИТЬ(ВерсииРасчетовСрезПоследних.Регистратор КАК Документ.ВерсияСоглашенияКредит).ВозобновляемыйЛимит КАК ВозобновляемыйЛимит,
	|		ВЫРАЗИТЬ(ВерсииРасчетовСрезПоследних.Регистратор КАК Документ.ВерсияСоглашенияКредит).Сумма + ЕСТЬNULL(РасчетыСКонтрагентамиФактОстаткиИОбороты.СуммаКонечныйОстаток, 0) КАК Сумма
	|	ИЗ
	|		РегистрСведений.ВерсииГрафиковРасчетов.СрезПоследних КАК ВерсииРасчетовСрезПоследних
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДоговорыКредитовИДепозитов_ КАК ДоговорыКредитовИДепозитов
	|			ПО ВерсииРасчетовСрезПоследних.ПредметГрафика = ДоговорыКредитовИДепозитов.Ссылка
	|				И (ДоговорыКредитовИДепозитов.ВидДоговораУХ = ЗНАЧЕНИЕ(Справочник.ВидыДоговоровКонтрагентовУХ.Кредит))
	|				И (ВЫРАЗИТЬ(ВерсииРасчетовСрезПоследних.Регистратор КАК Документ.ВерсияСоглашенияКредит).РазрешеноПланированиеТраншейИзПлатежногоКалендаря = ИСТИНА)
	|				И (ДоговорыКредитовИДепозитов.ВидСоглашения <> ЗНАЧЕНИЕ(Перечисление.ВидыСоглашений.Спецификация))
	|				И (ДоговорыКредитовИДепозитов.ОсновнаяВалютаПлатежей = &Валюта)
	|				И (ДоговорыКредитовИДепозитов.Организация = &Организация)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКонтрагентамиФакт.ОстаткиИОбороты(
	|					,
	|					,
	|					,
	|					,
	|					ЭлементСтруктурыЗадолженности = ЗНАЧЕНИЕ(Перечисление.ЭлементыСтруктурыЗадолженности.ОсновнойДолг)
	|						И ОбъектРасчетов.ВидДоговораУХ = ЗНАЧЕНИЕ(Справочник.ВидыДоговоровКонтрагентовУХ.Кредит)
	|						И Организация = &Организация
	|						И ОбъектРасчетов.ВалютаВзаиморасчетов = &Валюта) КАК РасчетыСКонтрагентамиФактОстаткиИОбороты
	|			ПО (ДоговорыКредитовИДепозитов.Ссылка = РасчетыСКонтрагентамиФактОстаткиИОбороты.ОбъектРасчетов.БазовыйДоговор)
	|	ГДЕ
	|		ВЫБОР
	|				КОГДА ВЫРАЗИТЬ(ВерсииРасчетовСрезПоследних.Регистратор КАК Документ.ВерсияСоглашенияКредит).ДатаНачалаДоступности <> ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА &ДатаПривлечения МЕЖДУ ВЫРАЗИТЬ(ВерсииРасчетовСрезПоследних.Регистратор КАК Документ.ВерсияСоглашенияКредит).ДатаНачалаДоступности И ВЫРАЗИТЬ(ВерсииРасчетовСрезПоследних.Регистратор КАК Документ.ВерсияСоглашенияКредит).ДатаОкончанияДоступности
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ) КАК КредитныеЛинии
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКонтрагентамиГрафики.ОстаткиИОбороты(, &ДатаПривлечения, Период, , ЭлементСтруктурыЗадолженности = ЗНАЧЕНИЕ(Перечисление.ЭлементыСтруктурыЗадолженности.ОсновнойДолг)) КАК РасчетыПоФинансовымИнструментамГрафикиОстаткиИОбороты
	|		ПО КредитныеЛинии.ВерсияПараметров = РасчетыПоФинансовымИнструментамГрафикиОстаткиИОбороты.ВерсияГрафика
	|
	|СГРУППИРОВАТЬ ПО
	|	КредитныеЛинии.Ссылка,
	|	КредитныеЛинии.Контрагент,
	|	КредитныеЛинии.МинимальныйСрок,
	|	КредитныеЛинии.МаксимальныйСрок,
	|	КредитныеЛинии.МинимальнаяСуммаСделки,
	|	КредитныеЛинии.МаксимальнаяСуммаСделки,
	|	КредитныеЛинии.ПроцентнаяСтавка,
	|	КредитныеЛинии.Сумма,
	|	КредитныеЛинии.ВозобновляемыйЛимит,
	|	КредитныеЛинии.ВалютаВзаиморасчетов,
	|	КредитныеЛинии.ОсновнаяВалютаПлатежей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_АктивныеДоговоры.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВТ_АктивныеДоговоры.Контрагент КАК Контрагент,
	|	ВТ_АктивныеДоговоры.ПроцентнаяСтавка КАК ПроцентнаяСтавка,
	|	ВТ_АктивныеДоговоры.МинимальныйСрок КАК МинимальныйСрок,
	|	ВТ_АктивныеДоговоры.МаксимальныйСрок КАК МаксимальныйСрок,
	|	ВТ_АктивныеДоговоры.МинимальнаяСуммаСделки КАК МинимальнаяСуммаСделки,
	|	ВТ_АктивныеДоговоры.МаксимальнаяСуммаСделки КАК МаксимальнаяСуммаСделки,
	|	ВТ_АктивныеДоговоры.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ВТ_АктивныеДоговоры.ОсновнаяВалютаПлатежей КАК ОсновнаяВалютаПлатежей,
	|	ВТ_АктивныеДоговоры.Доступно * (ВЫРАЗИТЬ(ЕСТЬNULL(КурсыВалютДоговора.Курс * КурсыВалютПлатежа.Кратность, 0) / ЕСТЬNULL(КурсыВалютДоговора.Кратность * КурсыВалютПлатежа.Курс, 1) КАК ЧИСЛО(10, 4))) КАК Доступно,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(КурсыВалютДоговора.Курс * КурсыВалютПлатежа.Кратность, 0) / ЕСТЬNULL(КурсыВалютДоговора.Кратность * КурсыВалютПлатежа.Курс, 1)  КАК ЧИСЛО(10, 4) ) Курс,
	|	ВТ_АктивныеДоговоры.ВозобновляемыйЛимит КАК ВозобновляемыйЛимит
	|ПОМЕСТИТЬ ВТ_АктивныеДоговоры_Курсы
	|ИЗ
	|	ВТ_АктивныеДоговоры КАК ВТ_АктивныеДоговоры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаПривлечения, ) КАК КурсыВалютДоговора
	|		ПО ВТ_АктивныеДоговоры.ВалютаВзаиморасчетов = КурсыВалютДоговора.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаПривлечения, ) КАК КурсыВалютПлатежа
	|		ПО ВТ_АктивныеДоговоры.ОсновнаяВалютаПлатежей = КурсыВалютПлатежа.Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_АктивныеДоговоры.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВТ_АктивныеДоговоры.Контрагент КАК Контрагент,
	|	ВТ_АктивныеДоговоры.ПроцентнаяСтавка КАК ПроцентнаяСтавка,
	|	ВТ_АктивныеДоговоры.МинимальныйСрок КАК МинимальныйСрок,
	|	ВТ_АктивныеДоговоры.МаксимальныйСрок КАК МаксимальныйСрок,  
	|	ВТ_АктивныеДоговоры.ВалютаВзаиморасчетов КАК Валюта,
	|	&Валюта КАК ВалютаСчета,
	|	ВТ_АктивныеДоговоры.Курс КАК Курс,
	|	ВТ_АктивныеДоговоры.МинимальнаяСуммаСделки КАК МинимальнаяСуммаСделки,
	|	ВТ_АктивныеДоговоры.МаксимальнаяСуммаСделки КАК МаксимальнаяСуммаСделки,
	|	ВТ_АктивныеДоговоры.Доступно - ЕСТЬNULL(СУММА(ВТ_ЗапланированныеСделки.Сумма), 0) КАК Доступно
	|ИЗ
	|	ВТ_АктивныеДоговоры_Курсы КАК ВТ_АктивныеДоговоры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗапланированныеСделки КАК ВТ_ЗапланированныеСделки
	|		ПО ВТ_АктивныеДоговоры.ДоговорКонтрагента = ВТ_ЗапланированныеСделки.ДоговорКонтрагента
	|			И (ВТ_ЗапланированныеСделки.ДатаОкончания >= &ДатаПривлечения
	|				ИЛИ НЕ ВТ_АктивныеДоговоры.ВозобновляемыйЛимит)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_АктивныеДоговоры.ДоговорКонтрагента,
	|	ВТ_АктивныеДоговоры.Контрагент,
	|	ВТ_АктивныеДоговоры.ПроцентнаяСтавка,
	|	ВТ_АктивныеДоговоры.МинимальныйСрок,
	|	ВТ_АктивныеДоговоры.МаксимальныйСрок,
	|	ВТ_АктивныеДоговоры.ВалютаВзаиморасчетов,
	|	ВТ_АктивныеДоговоры.Курс,
	|	ВТ_АктивныеДоговоры.МинимальнаяСуммаСделки,
	|	ВТ_АктивныеДоговоры.МаксимальнаяСуммаСделки,
	|	ВТ_АктивныеДоговоры.Доступно
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПроцентнаяСтавка УБЫВ";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "_ДоговорыКредитовИДепозитов_", 
		ДоговорыКонтрагентовВстраиваниеУХ.ИмяТаблицыСправочникаДоговорыКредитовИДепозитов());
		
	Возврат ТекстЗапроса;

КонецФункции

&НаСервере
Функция ТекстЗапросаРазмещение()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВТ_ЗапланированныеСделки.ФинансовыйИнструмент КАК ДоговорКонтрагента,
	|	ВТ_ЗапланированныеСделки.Сумма КАК Сумма,
	|	ВТ_ЗапланированныеСделки.ДатаНачала КАК ДатаНачала,
	|	ВТ_ЗапланированныеСделки.ДатаОкончания КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТ_ЗапланированныеСделки
	|ИЗ
	|	&ЗапланированныеСделки КАК ВТ_ЗапланированныеСделки
	|ГДЕ
	|	ВТ_ЗапланированныеСделки.ДатаНачала <= &ДатаПривлечения
	|	И ВТ_ЗапланированныеСделки.ДатаОкончания >= &ДатаПривлечения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоговорыКредитовИДепозитов.Ссылка КАК ДоговорКонтрагента,
	|	ДоговорыКредитовИДепозитов.Контрагент КАК Контрагент,
	|	ВЫРАЗИТЬ(ВерсииРасчетовСрезПоследних.Регистратор КАК Документ.ВерсияСоглашенияДепозит).ПроцентнаяСтавка КАК ПроцентнаяСтавка,
	|	ВЫРАЗИТЬ(ВерсииРасчетовСрезПоследних.Регистратор КАК Документ.ВерсияСоглашенияДепозит).МинимальныйСрок КАК МинимальныйСрок,
	|	ВЫРАЗИТЬ(ВерсииРасчетовСрезПоследних.Регистратор КАК Документ.ВерсияСоглашенияДепозит).МаксимальныйСрок КАК МаксимальныйСрок,
	|	ВЫРАЗИТЬ(ВерсииРасчетовСрезПоследних.Регистратор КАК Документ.ВерсияСоглашенияДепозит).МинимальнаяСуммаСделки КАК МинимальнаяСуммаСделки,
	|	ВЫРАЗИТЬ(ВерсииРасчетовСрезПоследних.Регистратор КАК Документ.ВерсияСоглашенияДепозит).МаксимальнаяСуммаСделки КАК МаксимальнаяСуммаСделки
	|ПОМЕСТИТЬ ВТ_ОткрытыеДоговоры
	|ИЗ
	|	РегистрСведений.ВерсииГрафиковРасчетов.СрезПоследних КАК ВерсииРасчетовСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДоговорыКредитовИДепозитов_ КАК ДоговорыКредитовИДепозитов
	|		ПО ВерсииРасчетовСрезПоследних.ПредметГрафика = ДоговорыКредитовИДепозитов.Ссылка
	|			И (ДоговорыКредитовИДепозитов.ВидФинансовогоИнструмента = ЗНАЧЕНИЕ(Перечисление.ВидыФинансовыхИнструментов.Депозит))
	|			И (ДоговорыКредитовИДепозитов.ВалютаВзаиморасчетов = &Валюта)
	|			И (ДоговорыКредитовИДепозитов.Организация = &Организация)
	|			И (ДоговорыКредитовИДепозитов.ВидСоглашения = ЗНАЧЕНИЕ(Перечисление.ВидыСоглашений.РамочныйДоговор))
	|ГДЕ
	|	&ДатаПривлечения МЕЖДУ ВЫРАЗИТЬ(ВерсииРасчетовСрезПоследних.Регистратор КАК Документ.ВерсияСоглашенияДепозит).ДатаНачалаДействия И ВЫРАЗИТЬ(ВерсииРасчетовСрезПоследних.Регистратор КАК Документ.ВерсияСоглашенияДепозит).ДатаОкончанияДействия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОткрытыеДоговоры.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВТ_ОткрытыеДоговоры.Контрагент КАК Контрагент,
	|	ВТ_ОткрытыеДоговоры.ПроцентнаяСтавка КАК ПроцентнаяСтавка,
	|	ВТ_ОткрытыеДоговоры.МинимальныйСрок КАК МинимальныйСрок,
	|	ВТ_ОткрытыеДоговоры.МаксимальныйСрок КАК МаксимальныйСрок,
	|	ВТ_ОткрытыеДоговоры.МинимальнаяСуммаСделки КАК МинимальнаяСуммаСделки,
	|	ВТ_ОткрытыеДоговоры.МаксимальнаяСуммаСделки КАК МаксимальнаяСуммаСделки,
	|	ЕСТЬNULL(СУММА(КлассыКонтрагентов.Задолженность), 0) КАК Доступно,
	|	СУММА(КлассыКонтрагентов.Задолженность) ЕСТЬ NULL КАК НеограниченнаяДоступность
	|ПОМЕСТИТЬ ВТ_АктивныеДоговоры
	|ИЗ
	|	ВТ_ОткрытыеДоговоры КАК ВТ_ОткрытыеДоговоры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлассыКонтрагентов.СрезПоследних КАК КлассыКонтрагентов
	|		ПО ВТ_ОткрытыеДоговоры.Контрагент = КлассыКонтрагентов.Контрагент
	|			И (КлассыКонтрагентов.РольКонтрагента = ЗНАЧЕНИЕ(Перечисление.РолиКонтрагентов.Банки))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОткрытыеДоговоры.Контрагент,
	|	ВТ_ОткрытыеДоговоры.ДоговорКонтрагента,
	|	ВТ_ОткрытыеДоговоры.ПроцентнаяСтавка,
	|	ВТ_ОткрытыеДоговоры.МинимальныйСрок,
	|	ВТ_ОткрытыеДоговоры.МаксимальныйСрок,
	|	ВТ_ОткрытыеДоговоры.МинимальнаяСуммаСделки,
	|	ВТ_ОткрытыеДоговоры.МаксимальнаяСуммаСделки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_АктивныеДоговоры.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВТ_АктивныеДоговоры.Контрагент КАК Контрагент,
	|	ВТ_АктивныеДоговоры.ПроцентнаяСтавка КАК ПроцентнаяСтавка,
	|	ВТ_АктивныеДоговоры.МинимальныйСрок КАК МинимальныйСрок,
	|	ВТ_АктивныеДоговоры.МаксимальныйСрок КАК МаксимальныйСрок,
	|	ВТ_АктивныеДоговоры.МинимальнаяСуммаСделки КАК МинимальнаяСуммаСделки,
	|	ВТ_АктивныеДоговоры.МаксимальнаяСуммаСделки КАК МаксимальнаяСуммаСделки,
	|	ВТ_АктивныеДоговоры.Доступно - ЕСТЬNULL(СУММА(ВТ_ЗапланированныеСделки.Сумма), 0) КАК Доступно,
	|	ВТ_АктивныеДоговоры.НеограниченнаяДоступность КАК НеограниченнаяДоступность
	|ИЗ
	|	ВТ_АктивныеДоговоры КАК ВТ_АктивныеДоговоры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗапланированныеСделки КАК ВТ_ЗапланированныеСделки
	|		ПО ВТ_АктивныеДоговоры.ДоговорКонтрагента = ВТ_ЗапланированныеСделки.ДоговорКонтрагента
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_АктивныеДоговоры.ДоговорКонтрагента,
	|	ВТ_АктивныеДоговоры.Контрагент,
	|	ВТ_АктивныеДоговоры.ПроцентнаяСтавка,
	|	ВТ_АктивныеДоговоры.МинимальныйСрок,
	|	ВТ_АктивныеДоговоры.МаксимальныйСрок,
	|	ВТ_АктивныеДоговоры.МинимальнаяСуммаСделки,
	|	ВТ_АктивныеДоговоры.МаксимальнаяСуммаСделки,
	|	ВТ_АктивныеДоговоры.Доступно,
	|	ВТ_АктивныеДоговоры.НеограниченнаяДоступность
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПроцентнаяСтавка УБЫВ";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "_ДоговорыКредитовИДепозитов_", 
		ДоговорыКонтрагентовВстраиваниеУХ.ИмяТаблицыСправочникаДоговорыКредитовИДепозитов());
		
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// Цвет фона выбранного договора
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	Для Каждого ТекЭлемент Из Элементы.ДоступныеИнструменты.ПодчиненныеЭлементы Цикл
		Если ТипЗнч(ТекЭлемент) = Тип("ГруппаФормы") Тогда
			Для Каждого ТекПоле Из ТекЭлемент.ПодчиненныеЭлементы Цикл
				КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, ТекПоле.Имя);
			КонецЦикла;
		Иначе
			КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, ТекЭлемент.Имя);
		КонецЕсли;
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДоступныеИнструменты.ДоговорКонтрагента", ВидСравненияКомпоновкиДанных.Равно,Новый ПолеКомпоновкиДанных("ФинансовыйИнструмент"),,Истина);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ГиперссылкаЦвет);
	
	//// Текст <Неогр.>
	//ЭлементУО = УсловноеОформление.Элементы.Добавить();
	//КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.ДоступныеИнструментыДоступно.Имя);
	//ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Неограниченно'"));
	
	// Цвет шрифта неподходящих договоров
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	Для Каждого ТекЭлемент Из Элементы.ДоступныеИнструменты.ПодчиненныеЭлементы Цикл
		Если ТипЗнч(ТекЭлемент) = Тип("ГруппаФормы") Тогда
			Для Каждого ТекПоле Из ТекЭлемент.ПодчиненныеЭлементы Цикл
				КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, ТекПоле.Имя);
			КонецЦикла;
		Иначе
			КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, ТекЭлемент.Имя);
		КонецЕсли;
	КонецЦикла;

	ГруппаОтбора = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(ЭлементУО.Отбор.Элементы,
		НСтр("ru = 'Группа ИЛИ'"), ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	
	// Условие 1: Есть ограничение доступных средств, и мы за него вышли.
	ГруппаОтбораДоступно = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
		ГруппаОтбора,
		НСтр("ru = 'Превышены доступные средства'"), 
		ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
		
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбораДоступно,
		"ДоступныеИнструменты.НеограниченнаяДоступность", ВидСравненияКомпоновкиДанных.Равно,Ложь,,Истина);
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбораДоступно,
		"Сумма", ВидСравненияКомпоновкиДанных.Больше,Новый ПолеКомпоновкиДанных("ДоступныеИнструменты.Доступно"),,Истина);
	
	// Условие 2: Не дотянули до минимальной суммы сделки.
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора,
		"Сумма", ВидСравненияКомпоновкиДанных.Меньше,Новый ПолеКомпоновкиДанных("ДоступныеИнструменты.МинимальнаяСуммаСделки"),,Истина);
	
	// Условие 3. Вышли за максимальную сумму сделки
	ГруппаОтбораМаксимальнаяСумма = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
		ГруппаОтбора,
		НСтр("ru = 'Превышена максимальная сумма'"), 
		ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
		
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбораМаксимальнаяСумма,
		"ДоступныеИнструменты.МаксимальнаяСуммаСделки", ВидСравненияКомпоновкиДанных.Больше,0,,Истина);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбораМаксимальнаяСумма,
		"Сумма", ВидСравненияКомпоновкиДанных.Больше,Новый ПолеКомпоновкиДанных("ДоступныеИнструменты.МаксимальнаяСуммаСделки"),,Истина);
	
	// Условие 4. Не дотянули до минимального срока
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора,
		"КоличествоДней", ВидСравненияКомпоновкиДанных.Меньше,Новый ПолеКомпоновкиДанных("ДоступныеИнструменты.МинимальныйСрок"),,Истина);
	
	// Условие 5. Вышли за максимальный срок.
	ГруппаОтбораМаксимальныйСрок = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
		ГруппаОтбора,
		НСтр("ru = 'Превышен максимальный срок'"), 
		ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбораМаксимальныйСрок,
		"ДоступныеИнструменты.МаксимальныйСрок", ВидСравненияКомпоновкиДанных.Больше,0,,Истина);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбораМаксимальныйСрок,
		"КоличествоДней", ВидСравненияКомпоновкиДанных.Больше,Новый ПолеКомпоновкиДанных("ДоступныеИнструменты.МаксимальныйСрок"),,Истина);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветНедоступногоТекста);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПересчитатьКонечныйОстаток(Форма)

	Если Форма.ЭтоПривлечениеСредств Тогда
		Форма.КонечныйОстатокНаСчете = Форма.НачальныйОстатокНаСчете + Форма.Сумма;
	Иначе
		Форма.КонечныйОстатокНаСчете = Форма.НачальныйОстатокНаСчете - Форма.Сумма;
	КонецЕсли;	

КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьВалют()
	
	Если НЕ ЭтоПривлечениеСредств Тогда
		Элементы.ГруппаСуммаЗачисления.Видимость = Ложь;
		Возврат;
	КонецЕсли;	
	
	ЭтоМультивалютныйПлатеж = ЗначениеЗаполнено(Валюта) И 
								ЗначениеЗаполнено(ВалютаЗачисления)  И
								Валюта <> ВалютаЗачисления;
	Элементы.ГруппаСуммаЗачисления.Видимость = ЭтоМультивалютныйПлатеж;
	Элементы.ГруппаСуммаОперации.Доступность = НЕ ЭтоМультивалютныйПлатеж;
	
	ЗаголовокСумма = ?(ЭтоМультивалютныйПлатеж, НСтр("ru = 'Сумма к зачислению'"), НСтр("ru = 'Сумма привлечения'"));
	ЗаголовокСуммаЗачисления = ?(ЭтоМультивалютныйПлатеж,  НСтр("ru = 'Сумма привлечения'"),НСтр("ru = 'Сумма к зачислению'"));
	
	Элементы.Сумма.Заголовок = ЗаголовокСумма;
	Элементы.СуммаЗачисления.Заголовок = ЗаголовокСуммаЗачисления;
	
КонецПроцедуры
 
#КонецОбласти
